In [1]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv'],
                'Marks':[98,89,99,87,90],
                'Grades':['AA','AB','AA','AB','AC']
               }
df1=pd.DataFrame(dict1,index=['stu1','stu2','stu3','stu4','stu5'])
df1

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     90     AC

 in boolean array the array size must be data frame size means here rows are 5 and cploumns are 3 so we need to cretae a boolean index with rows 5 and coloums 3

In [2]:
df1.loc[[False,False,False,False,False],[False,False,False]]

Empty DataFrame
Columns: []
Index: []

In [6]:
df1.loc[[True,False,False,True,False],[True,True,False]]

         Name  Marks
stu1  Priyang     98
stu4   Vedant     87

# 1.Name of stu1 and stu2

In [9]:
df1.loc[[True,True,False,False,False],[True,False,False]]

         Name
stu1  Priyang
stu2   Aadhya

# 2. Name of stu1 and his grade

In [10]:
df1.loc[[True,False,False,False,False],[False,False,True]]

     Grades
stu1     AA

# 3.Grade of stu1 and stu5

In [11]:
df1.loc[[True,False,False,False,True],[False,False,True]]

     Grades
stu1     AA
stu5     AC

if we use iloc also nothing changes output doesnot changes

In [12]:
df1.iloc[[True,True,False,False,False],[True,False,False]]

         Name
stu1  Priyang
stu2   Aadhya

In [13]:
df1.iloc[[True,False,False,False,False],[False,False,True]]

     Grades
stu1     AA

In [14]:
df1.iloc[[True,False,False,False,True],[False,False,True]]

     Grades
stu1     AA
stu5     AC